Repository: vdelachaux/4DPop-Family
Catalog: 4DPop-Family-20/Components/4DPop AppMaker.4dbase/Resources/*.lproj/AppMaker.xlf
Languages: fr

# CompilationAndGeneration
source: Compilation & generation..
fr: Compilation & génération...

source: Preparation of copy...
fr: Préparation de la copie...

source: Increment version number
fr: Incrément du numéro de version

source: Preparation…
fr: Préparation…

source: Copy:
fr: Copie :

source: Preparing for removal…
fr: Préparation de la suppression...

source: Remove:
fr: Suppression de :

# executionOfMethod
source: Execution of method "{methodName}""
fr: Exécution de la méthode "{methodName}"

# methodFailed
source: Method failed ({methodName})
fr: Échec ({methodName})

source: Browse…
fr: Parcourir…

source: Delete Mac OS specific files
fr: Suppression des fichiers Mac OS

source: The build is achieved
fr: La génération est terminée

# alphaSize
source: The size of this value is limited to
fr: La longueur de cette valeur est limitée à

source: Application name:
fr: Nom de l'application :

source: Are you sure you want to clear this key?
fr: Êtes vous certain de vouloir détruire cette clef ?

# boolean
source: Value:
fr: Valeur :

# comment
source: Comments:
fr: Commentaires :

# company-name
source: Company:
fr: Entreprise :

# component
source: Selected components will be integrated in the application. For a component, they will be ignored.
fr: Les composants sélectionnés seront intégrés dans l'application. Pour un composant, ils seront ignorés.

source: Creator:
fr: Créateur :

source: Delete specific Mac content
fr: Supprimez le contenu spécifique Mac

# Editor_closeThisWindowIfNoError
source: Close this window if no error
fr: Fermez cette fenêtre si aucune erreur

# Editor_compressZipTheSourceFile4Db
source: Compress (ZIP) the source file (.4DB)
fr: Compresser (ZIP) le fichier source (.4DB)

# Editor_incrementTheBuildNumber
source: Increment the build number
fr: Incrémenter le numéro de build

# Editorcopy
source: Copy:
fr: Copier :

# Editordelete
source: Delete:
fr: Effacer :

# EditormethodToRunAfterGeneration
source: Method to run after generation:
fr: Methode à exécuter après la génération :

# EditormethodToRunBeforeGeneration
source: Method to run before generation:
fr: Methode à exécuter avant la génération :

source: False
fr: Faux

source: File:
fr: Fichier :

source: File Description:
fr: Description :

source: File…
fr: Fichier…

source: Finishes
fr: Finitions

source: Folder:
fr: Dossier :

source: Folder…
fr: Dossier…

source: Internal Name
fr: Nom interne :

# ip
source: IP Address:
fr: Adresse IP :

source: Keys
fr: Clefs

source: Legal Trademark:
fr: Marques légales :

# licences
source: Licences in the table below will be included in the application.
fr: Les licences du tableau ci-dessous seront intégrées à l'application.

# no-component
source: There is no component installed
fr: Il n'y a pas de composant installé

# no-plugin
source: There is no plugin installed
fr: Il n'y a pas de plugin installé

# plugin
source: Selected plugins will be integrated in the application. For a component, they will be ignored.
fr: Les plugins sélectionnés seront intégrés dans l'application. Pour un composant, ils seront ignorés.

source: Preparations
fr: Préparatifs

source: Private Build:
fr: Description personnelle :

# selectFile
source: Select a file:
fr: Sélectionnez un fichier :

# selectFolder
source: Select a folder:
fr: Sélectionnez un dossier :

source: Special Build:
fr: Description de compilation :

source: True
fr: Vrai

source: Values
fr: Valeurs

# version
source: Version number:
fr: Numéro de version :

# parametersWindowTitle
source: AppMaker Settings
fr: Paramètres de AppMaker

source: 4D XML Keys BuildApplication
fr: Clefs XML du BuildApplication 4D

# Editor_revealTheTargetFileWhenItsOver
source: Reveal the target file when it's over
fr: Révéler le fichier cible quand c'est fini

# selectExe
source: Select a package:
fr: Sélectionnez un package :

# certificate
source: Name of certificate:
fr: Nom du certificat :

source: Sign application:
fr: Signer l'application :

source: Remove unnecessary resources for the final users
fr: Retirer les ressources inutiles pour les utilisateurs finaux

# LaunchCompiledDatabase
source: Launch the target
fr: Ouvrir la cible

source: Export project
fr: Exporter le project

source: Git Repository
fr: Dépôt Git

# tips.copy
source: Files or folders to add to the package. (same relative path as the source)
fr: Fichiers ou dossiers à ajouter au paquet. (même chemin relatif que la source)

# tips.delete
source: Files or folders to delete from the package. (relative path to target)
fr: Les fichiers ou dossiers à supprimer dans le paquet. (chemin d'accès relatif à la cible)

# tips.info.plist
source: These key / value pair are used to build the files "infoplist.strings"in each language.
fr: Ces couples clef/valeur sont utilisés pour construire les fichiers "infoplist.strings" dans chaque langue.

# tips.method.after
source: This method will be executed after build.
fr: Cette méthode sera exécutée après la génération.

# tips.method.before
source: This method will be executed before build. It should return True for the generation begins and be shared between the components and the host database
fr: Cette méthode sera exécutée avant la génération. Elle doit retourner Vrai pour que la génération soit lancée et être partagé entre les composants et la base hôte.

# tips.run
source: Click to build (Enter key)
fr: Cliquez pour construire (Entrée)

# tips.specificMacContent
source: On Macintosh, the generated package will be stripped of any Mac OS specific files (invisible files...)
fr: Sur Macintosh, le package généré sera débarrassé de tous les fichiers spécifiques à Mac OS (fichiers invisibles ...)

# tips.LaunchCompiledDatabase
source: Open the compiled database or launch the final application or the server executable
fr: Ouvre la base compilée ou lancer l'application finale ou le serveur

# tips.RemoveUnnecessaryResourcesForTheFinalUsers
source: Removes, if any, the 4D SVG Help file, constants' files etc… in the compiled package and/or the standalone application and/or the Server executable. The items to remove are listed in the file "appMaker delete.xml" at the root of the preferences' folder of your database. If this file doesn't exist, a default set is used (file at the root of the resources' folder of this component)
fr: Supprime, si besoin, le fichier d'aide 4D SVG, les fichiers de constantes etc… dans la base compilée et/ou l'application enginée et/ou l'application Serveur. Les éléments à supprimer sont listés dans le fichier "AppMaker delete.xml" à la racine du dossier des préférences de votre base. Si ce fichier n'existe pas, un ensemble par défaut est utilisé (fichier à la racine du dossier Resources de ce composant)

# tips.exportStructure
source: Export forms & methods as textual files to allow source control
fr: Exportez les formulaires et les méthodes sous forme de fichiers texte pour permettre le contrôle de source

# tips.gitRepository
source: Manage the folder as a local git repository
fr: Gérer le dossier en tant que dépôt git local

# 4DPop_run
source: Build
fr: Construire

# 4DPop_parameters
source: Paramaters…
fr: Paramètres…

# Window_compiler
source: Compiler
fr: Compilateur
