Repository: vdelachaux/4DPop-Family
Catalog: 4DPop-Family-20/Components/4DPop AppMaker.4dbase/Resources/*.lproj/BuildAppKey.xlf
Languages: fr

# Versioning
source: These parameters allow you to set options related to version numbers and built file information. These parameters must be surrounded with <Versioning> and </Versioning> keys. These parameters are broken down into four subsets: • Common: common files, • RuntimeVL: 4D Runtime Volume License files, • Server: 4D Server files, • Client: 4D Client files. Certain keys in the Common subset set the same information as the other subsets - only the application field is different. In the event that two similar keys are used, the "specific" key (RuntimeVL, Server, or Client subset) has priority over the "generic" key (Common subset).
fr: Ces paramètres permettent de définir des options relatives aux numéros de versions et aux informations des fichiers générés. Ils doivent être encadrés des clés <Versioning> et </Versioning>. Ces paramètres se déclinent en quatre sous-ensembles : • Common pour les fichiers communs, • RuntimeVL pour les fichiers de 4D Runtime Volume License, • Server pour les fichiers de 4D Server, • Client pour les fichiers de 4D Client. Certaines clés du sous-ensemble Common définissent les mêmes informations que celles des autres sous-ensembles - seul leur champ d'application est différent. Dans le cas où deux clés semblables sont utilisées, la clé "spécifique" (sous-ensemble RuntimeVL, Server ou Client) a priorité par rapport à la clé "générique" (sous-ensemble Common).

# /Preferences4D/BuildApp/AutoUpdate
source: 'AutoUpdate' XML keys are available beginning with 4D v14. They allow you to elevate the installation privileges under Windows, so that the "updater" utility can install merged applications (clients and/or server) in protected system locations such as the "Desktop". Note: It is generally not recommended to install merged applications in the "Program Files" folder under Windows since this folder includes specific mechanisms that are incompatible with the functioning of 4D applications. When these keys are set to True and the "updater" program attempts to update an applications in a protected location, a warning dialog box informs you that administrator privileges are required. If necessary, a dialog box appears on the machine so that you can log on using an administrator account.
fr: Les clés XML 'AutoUpdate' sont disponibles à compter de 4D v14. Elles permettent d’élever les privilèges d’installation sous Windows, permettant à l’utilitaire "updater" d’installer des applications fusionnées (clientes et/ou serveur) dans les emplacements protégés du système tels que le "Bureau". Note : Il est généralement déconseillé d’installer des applications fusionnées dans le dossier "Program Files" sous Windows car ce dossier inclut des mécanismes spécifiques incompatibles avec le fonctionnement des applications 4D. Lorsque ces clés sont à True et que le programme "updater" tente de mettre à jour une application dans un emplacement protégé, une boîte de dialogue d’alerte indique que des privilèges d’administrateur sont requis. Si nécessaire, une boîte de dialogue de saisie d’identifiants s’affiche sur le poste, permettant d’utiliser un compte d’administrateur.

# /Preferences4D/BuildApp/AutoUpdate/RuntimeVL/StartElevated
source: Windows only: When this key contains the value True, the update of the single-user application is performed with the administrator privileges of the machine. When it contains False (default), this update is performed without elevating privileges. Under OS X, this key is always False.
fr: Windows uniquement : si cette clé contient la valeur True, la mise à jour de l’application monoposte est effectuée avec les privilèges d’administrateur de la machine. Si elle vaut False (défaut), la mise à jour est effectuée sans élévation des privilèges. Sous OS X, cette clé est toujours False.

# /Preferences4D/BuildApp/AutoUpdate/CS/Server/StartElevated
source: Windows only: When this key contains the value True, the update of the server application is performed with the administrator privileges of the machine. When it contains False (default), this update is performed without elevating privileges. Under OS X, this key is always False.
fr: Windows uniquement : si cette clé contient la valeur True, la mise à jour de l’application serveur est effectuée avec les privilèges d’administrateur de la machine. Si elle vaut False (défaut), la mise à jour est effectuée sans élévation des privilèges. Sous OS X, cette clé est toujours False.

# /Preferences4D/BuildApp/AutoUpdate/CS/Client/StartElevated
source: Windows only: When this key contains the value True, the update of the merged client application is performed with the administrator privileges of the machine. When it contains False (default), this update is performed without elevating privileges. Under OS X, this key is always False.
fr: Windows uniquement : si cette clé contient la valeur True, la mise à jour de l’application cliente fusionnée est effectuée avec les privilèges d’administrateur de la machine. Si elle vaut False (défaut), la mise à jour est effectuée sans élévation des privilèges. Sous OS X, cette clé est toujours False.

# /Preferences4D/BuildApp/AutoUpdate/CS/ClientUpdateWin/StartElevated
source: OS X only: When this key contains the value True, the update of the Windows client application is performed with the administrator privileges of the machine. When it contains False (default), this update is performed without elevating privileges. Under Windows, this key is ignored.
fr: OS X uniquement : si cette clé contient la valeur True, la mise à jour de l’application cliente Windows est effectuée avec les privilèges d’administrateur de la machine. Si elle vaut False (défaut), la mise à jour est effectuée sans élévation des privilèges. Sous Windows, cette clé est ignorée.
