Repository: vdelachaux/4DPop-Family
Catalog: 4DPop-Family-20/Components/4DPop AppMaker.4dbase/Resources/*.lproj/BuildAppKey.xlf
Languages: fr

# ClientMacFolderToMac
source: This key provides the access path of the 4D Client Mac OS application for the Mac OS platform. This key is mandatory if the BuildServerApplication key is set to True under Mac OS.
fr: Cette clé fournit le chemin d'accès du dossier contenant l'application 4D Client Mac OS destiné à la plate-forme Mac OS. Cette clé est obligatoire si la clé BuildServerApplication est mise à True sur la plate-forme Mac OS.

# ServerIconWinPath
source: This key provides the access path of the 4D Server icon to build for the Windows platform. This icon will have a ".ico" extension. If this key is omitted, the 4D Server default icon will be used.
fr: Cette clé fournit le chemin d'accès de l'icône de l'application 4D Server à générer pour la plate-forme Windows. L'icône sera du type ".ico". Si cette clé est omise, l'icône par défaut de 4D Server sera utilisée.

# ServerIconMacPath
source: This key provides the access path of the 4D Server icon to build for the Mac OS platform. This icon will have a "icns" extension. Consequently, the "info.plist" file will be updated. If this key is omitted, the 4D Server default icon will be used.
fr: Cette clé fournit le chemin d'accès de l'icône de l'application 4D Server à générer pour la plate-forme Mac OS. L'icône sera du type "icns". Le fichier "info.plist" sera mis à jour en conséquence. Si cette clé est omise, l'icône par défaut de 4D Server sera utilisée.

# ClientMacIconForMacPath
source: This key provides the access path under Mac OS of the client application icon to generate for Mac OS. This icon will have a "icns" extension. If this key is omitted, the 4D Client default icon will be used.
fr: Cette clé fournit le chemin d'accès sous Mac OS de l'icône de l'application cliente à générer pour la plate-forme Mac OS. L'icône sera du type "icns". Si cette clé est omise, l'icône par défaut de 4D Client sera utilisée.

# ClientWinIconForMacPath
source: This key provides the access path under Mac OS of the client application icon to generate for Windows. This icon will have a ".ico" extension. If this key is omitted, the 4D Client default icon will be used.
fr: Cette clé fournit le chemin d'accès sous Mac OS de l'icône de l'application cliente à générer pour la plate-forme Windows. L'icône sera du type ".ico". Si cette clé est omise, l'icône par défaut de 4D Client sera utilisée.

# ClientMacIconForWinPath
source: This icon provides the access path under Windows of the client application icon to build for Mac OS. This icon will have a "icns" extension. If this key is omitted, the 4D Client default icon will be used.
fr: Cette clé fournit le chemin d'accès sous Windows de l'icône de l'application cliente à générer pour la plate-forme Mac OS. L'icône sera du type "icns". Si cette clé est omise, l'icône par défaut de 4D Client sera utilisée.

# ClientWinIconForWinPath
source: This key provides the access path under Windows of the client application icon to generate for Windows. This icon will have a ".ico" extension. If this key is omitted, the 4D Client default icon will be used.
fr: Cette clé fournit le chemin d'accès sous Windows de l'icône de l'application cliente à générer pour la plate-forme Windows. L'icône sera du type ".ico". Si cette clé est omise, l'icône par défaut de 4D Client sera utilisée.

# IsOEM
source: This key is used to determine whether or not the OEM deployment licenses will be taken into account for the client/server application built. If this key is set to True, the application will integrate the OEM deployment licenses. If this key is not passed or is set to False, the application will not integrate the OEM deployment licenses. In this case, the application will be built in demo mode. Keep in mind that using this key requires an OEM license.
fr: Cette clé permet de prendre en compte ou non les licences de déploiement OEM pour l'application client/serveur générée. Si cette clé contient la valeur True, l'application intégrera les licences de déploiement OEM. Si cette clé contient la valeur False ou est omise, l'application n'intégrera pas les licences de déploiement OEM. Dans ce cas, l'application sera générée en mode évaluation. A noter que l'emploi de cette clé requiert une licence OEM.

# CommonVersion
source: This key contains the version number of the application built. If it is omitted and if none of the RuntimeVLVersion, ServerVersion or ClientVersion keys are passed, the version number of the 4th Dimension application (4D Runtime Volume License, 4D Server or 4D Client) is used. Under Windows, this key causes the File version and Product version fields of the properties window to be updated. Under Mac OS, this key causes the CFBundleShortVersionString and CFBundleVersion fields of the "info.plist" file to be updated.
fr: Cette clé contient le numéro de version de l'application générée. Si elle est omise et si aucune des clés RuntimeVLVersion, ServerVersion ou ClientVersion n'est passée, le numéro de version de l'application 4e Dimension (4D Runtime Volume License, 4D Server ou 4D Client) est utilisé. Sous Windows, cette clé entraîne la mise à jour des champs Version du fichier et Version du produit de la fenêtre des propriétés. Sous Mac OS, cette clé entraîne la mise à jour des champs CFBundleShortVersionString et CFBundleVersion du fichier "info.plist".

# CommonCopyright
source: This key contains the text to insert in: \t• the CFBundleGetInfoString field of the "info.plist" file under Mac OS, \t• the Copyright field of the Properties window under Windows. If this key is omitted and if none of the RuntimeVLCopyright, ServerCopyright or ClientCopyright keys are passed, the Copyright information of the 4th Dimension application (4D Runtime Volume License, 4D Server or 4D Client) is used.
fr: Cette clé contient le texte à insérer dans : \t• tle champ CFBundleGetInfoString du fichier "info.plist" sous Mac OS, \t• tle champ Copyright de la fenêtre des Propriétés sous Windows. Si cette clé est omise et si aucune des clés RuntimeVLCopyright, ServerCopyright ou ClientCopyright n'est passée, les informations de Copyright de l'application 4e Dimension (4D Runtime Volume License, 4D Server or 4D Client) sont utilisées.

# CommonCreator
source: This key can only be used under Mac OS. This key is used to define the creator for the Mac OS application built. Its maximum size is 4 characters. If this key is omitted and if none of the RuntimeVLCreator, ServerCreator or ClientCreator keys are passed, the creator of the 4th Dimension applications (4D06) is used. This key does nothing under Windows.
fr: Cette clé est utilisable sous Mac OS uniquement. Cette clé permet de définir le créateur (creator) pour l'application Mac OS générée. Sa taille maximale est de 4 caractères. Si cette clé est omise et si aucune des clés RuntimeVLCreator, ServerCreator ou ClientCreator n'est passée, le créateur des applications 4e Dimension (4D06) est utilisé. Sous Windows, cette clé n'a pas d'effet.

# CommonComment
source: This key is only used under Windows. This key allows you to update the Comment field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if none of the RuntimeVLComment, ServerComment or ClientComment keys are passed, the comments associated with the 4th Dimension application (4D Runtime Volume License, 4D Server or 4D Client) are used. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Commentaires de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si aucune des clés RuntimeVLComment, ServerComment ou ClientComment n'est passée, les commentaires associés à l'application 4e Dimension (4D Runtime Volume License, 4D Server ou 4D Client) sont utilisées. Sous Mac OS, cette clé n'a pas d'effet.

# CommonCompanyName
source: This key is only used under Windows. This key allows you to update the Company name field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if none of the RuntimeVLCompanyName, ServerCompanyName or ClientCompanyName keys are passed, the company name associated with the 4th Dimension application (4D Runtime Volume License, 4D Server or 4D Client) is used. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Entreprise de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si aucune des clés RuntimeVLCompanyName, ServerCompanyName ou ClientCompanyName n'est passée, le nom d'entreprise associé à l'application 4e Dimension (4D Runtime Volume License, 4D Server ou 4D Client) est utilisé. Sous Mac OS, cette clé n'a pas d'effet.

# CommonFileDescription
source: This key is only used under Windows. This key allows you to update the Description field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if none of the RuntimeVLFileDescription, ServerFileDescription or ClientFileDescription keys are passed, the description associated with the 4th Dimension application (4D Runtime Volume License, 4D Server or 4D Client) is used. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Description de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si aucune des clés RuntimeVLFileDescription, ServerFileDescription ou ClientFileDescription n'est passée, la description associée à l'application 4e Dimension (4D Runtime Volume License, 4D Server ou 4D Client) est utilisée. Sous Mac OS, cette clé n'a pas d'effet.

# CommonInternalName
source: This key is only used under Windows. This key allows you to update the Internal name field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if none of the RuntimeVLInternalName, ServerInternalName or ClientInternalName keys are passed, the internal name associated with the 4th Dimension application (4D Runtime Volume License, 4D Server or 4D Client) is used. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Nom interne de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si aucune des clés RuntimeVLInternalName, ServerInternalName ou ClientInternalName n'est passée, le nom interne associé à l'application 4e Dimension (4D Runtime Volume License, 4D Server ou 4D Client) est utilisé. Sous Mac OS, cette clé n'a pas d'effet.

# CommonLegalTrademark
source: This key is only used under Windows. This key allows you to update the Legal trademark field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if none of the RuntimeVLLegalTrademark, ServerLegalTrademark or ClientLegalTrademark keys are passed, the legal trademarks associated with the 4th Dimension application (4D Runtime Volume License, 4D Server or 4D Client) are used. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Marques légales de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si aucune des clés RuntimeVLLegalTrademark, ServerLegalTrademark ou ClientLegalTrademark n'est passée, les mentions de marques légales associées à l'application 4e Dimension (4D Runtime Volume License, 4D Server ou 4D Client) sont utilisées. Sous Mac OS, cette clé n'a pas d'effet.

# CommonPrivateBuild
source: This key is only used under Windows. This key allows you to update the Private build field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if none of the RuntimeVLPrivateBuild, ServerPrivateBuild or ClientPrivateBuild keys are passed, the private builds associated with the 4th Dimension application (4D Runtime Volume License, 4D Server or 4D Client) are used. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Description personnelle de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si aucune des clés RuntimeVLPrivateBuild, ServerPrivateBuild ou ClientPrivateBuild n'est passée, les descriptions personnelles associées à l'application 4e Dimension (4D Runtime Volume License, 4D Server ou 4D Client) sont utilisées.

# CommonSpecialBuild
source: This key is only used under Windows. This key allows you to update the Special build field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if none of the RuntimeVLSpecialBuild, ServerSpecialBuild or ClientSpecialBuild keys are passed, the special builds associated with the 4th Dimension application (4D Runtime Volume License, 4D Server or 4D Client) are used. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Description de compilation de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si aucune des clés RuntimeVLSpecialBuild, ServerSpecialBuild ou ClientSpecialBuild n'est passée, les descriptions de compilation associées à l'application 4e Dimension (4D Runtime Volume License, 4D Server ou 4D Client) sont utilisées. Sous Mac OS, cette clé n'a pas d'effet.

# Common
source: Versioning parameters set options related to version numbers and built file information. The keys of this subset are common to all 4D applications (4D Volume Desktop and 4D Server).
fr: Ces paramètres permettent de définir des options relatives aux numéros de versions et aux informations des fichiers générés. Les clés de ce sous-ensemble sont communes aux deux applications 4D (4D Volume Desktop et 4D Server).

# RuntimeVLVersion
source: This key contains the version number of the application built. If it is omitted and if the CommonVersion key is also omitted, the 4D Runtime Volume License version number is used. Conversely, if both keys are used, only the value set using the RuntimeVLVersion key is taken into account. Under Windows, this key causes the File version and Product version fields of the properties window to be updated. Under Mac OS, this key causes the CFBundleShortVersionString and CFBundleVersion fields of the "info.plist" file to be updated.
fr: Cette clé contient le numéro de version de l'application générée. Si elle est omise et si la clé CommonVersion l'est également, le numéro de version de 4D Runtime Volume License est utilisé. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé RuntimeVLVersion est prise en compte. Sous Windows, cette clé entraîne la mise à jour des champs Version du fichier et Version du produit de la fenêtre des propriétés. Sous Mac OS, cette clé entraîne la mise à jour des champs CFBundleShortVersionString et CFBundleVersion du fichier "info.plist".

# RuntimeVLCopyright
source: This key contains the text inserted into: \t• the CFBundleGetInfoString field of the "info.plist" file under Mac OS, \t• the Copyright field of the Properties window under Windows. If this key is omitted and if the CommonCopyright key is also omitted, the Copyright information of the 4D Runtime Volume License application is used. Conversely, if both keys are used, only the value set using the RuntimeVLCopyright key is taken into account.
fr: Cette clé contient le texte à insérer dans : \t• le champ CFBundleGetInfoString du fichier "info.plist" sous Mac OS, \t• le champ Copyright de la fenêtre des Propriétés sous Windows. Si cette clé est omise et si la clé CommonCopyright l'est également, les informations de Copyright de l'application 4D Runtime Volume License sont utilisées. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé RuntimeVLCopyright est prise en compte.

# RuntimeVLCreator
source: This key is only used under Mac OS. This key is used to define the creator for the Mac OS application built. Its maximum size is 4 characters. If this key is omitted and if the CommonCreator key is not passed, the creator of the 4D Runtime Volume License (4D06) is used. Conversely, if both keys are used, only the value set using the RuntimeVLCreator key is taken into account. This key does nothing under Windows.
fr: Cette clé est utilisable sous Mac OS uniquement. Cette clé permet de définir le créateur (creator) pour l'application Mac OS générée. Sa taille maximale est de 4 caractères. Si cette clé est omise et si la clé CommonCreator n'est pas passée, le créateur de 4D Runtime Volume License (4D06) est utilisé. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé RuntimeVLCreator est prise en compte. Sous Windows, cette clé n'a pas d'effet.

# RuntimeVLComment
source: This key is only used under Windows. This key allows you to update the Comment field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonComment key is also omitted, the comments associated with the 4D Runtime Volume License application are used. Conversely, if both keys are used, only the value set using the RuntimeVLComment key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Commentaires de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonComment l'est également, les commentaires associés à l'application 4D Runtime Volume License sont utilisées. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé RuntimeVLComment est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# RuntimeVLCompanyName
source: This key is only used under Windows. This key allows you to update the Company name field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonCompanyName key is also omitted, the company name associated with the 4D Runtime Volume License application is used. Conversely, if both keys are used, only the value set using the RuntimeVLCompanyName key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Entreprise de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonCompanyName l'est également, le nom d'entreprise associé à l'application 4D Runtime Volume License est utilisé. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé RuntimeVLCompanyName est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# RuntimeVLFileDescription
source: This key is only used under Windows. This key allows you to update the File description field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonFileDescription key is also omitted, the file description associated with the 4D Runtime Volume License application is used. Conversely, if both keys are used, only the value set using the RuntimeVLFileDescription key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Description de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonFileDescription l'est également, la description associée à l'application 4D Runtime Volume License est utilisée. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé RuntimeVLFileDescription est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# RuntimeVLInternalName
source: This key is only used under Windows. This key allows you to update the Internal name field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonInternalName key is also omitted, the internal name associated with the 4D Runtime Volume License application is used. Conversely, if both keys are used, only the value set using the RuntimeVLInternalName key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Nom interne de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonInternalName l'est également, le nom interne associé à l'application 4D Runtime Volume License est utilisé. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé RuntimeVLInternalName est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# RuntimeVLLegalTrademark
source: This key is only used under Windows. This key allows you to update the Legal trademark field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonLegalTrademark key is also omitted, the legal trademarks associated with the 4D Runtime Volume License application are used. Conversely, if both keys are used, only the value set using the RuntimeVLLegalTrademark key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Marques légales de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonLegalTrademark l'est également, les mentions de marques légales associées à l'application 4D Runtime Volume License sont utilisées. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé RuntimeVLLegalTrademark est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# RuntimeVLPrivateBuild
source: This key is only used under Windows. This key allows you to update the Private build field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonPrivateBuild key is also omitted, the private build associated with the 4D Runtime Volume License application is used. Conversely, if both keys are used, only the value set using the RuntimeVLPrivateBuild key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Description personnelle de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonPrivateBuild l'est également, la description personnelle associée à l'application 4D Runtime Volume License est utilisée. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé RuntimeVLPrivateBuild est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.
