Repository: vdelachaux/4DPop-Family
Catalog: 4DPop-Family-20/Components/4DPop AppMaker.4dbase/Resources/*.lproj/BuildAppKey.xlf
Languages: fr

# RuntimeVLSpecialBuild
source: This key is only used under Windows. This key allows you to update the Special build field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonSpecialBuild key is also omitted, the special build associated with the 4D Runtime Volume License application is used. Conversely, if both keys are used, only the value set using the RuntimeVLSpecialBuild key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Description de compilation de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonSpecialBuild l'est également, la description de compilation associée à l'application 4D Runtime Volume License est utilisée. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé RuntimeVLSpecialBuild est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# ServerVersion
source: This key contains the version number of the application built. If it is omitted and if the CommonVersion key is also omitted, the 4D Server version number is used. Conversely, if both keys are used, only the value set using the ServerVersion key is taken into account. Under Windows, this key causes the File version and Product version fields of the properties window to be updated. Under Mac OS, this key causes the CFBundleShortVersionString and CFBundleVersion field of the "info.plist" file to be updated.
fr: Cette clé contient le numéro de version de l'application générée. Si elle est omise et si la clé CommonVersion l'est également, le numéro de version de 4D Server est utilisé. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ServerVersion est prise en compte. Sous Windows, cette clé entraîne la mise à jour des champs Version du fichier et Version du produit de la fenêtre des propriétés. Sous Mac OS, cette clé entraîne la mise à jour des champs CFBundleShortVersionString et CFBundleVersion du fichier "info.plist".

# ServerCopyright
source: This key contains the text inserted into: \t• the CFBundleGetInfoString field of the "info.plist" file under Mac OS, \t• the Copyright field of the Properties window under Windows. If this key is omitted and if the CommonCopyright key is also omitted, the Copyright information of the 4D Server application is used. Conversely, if both keys are used, only the value set using the ServerCopyright key is taken into account.
fr: Cette clé contient le texte à insérer dans : \t• le champ CFBundleGetInfoString du fichier "info.plist" sous Mac OS, \t• le champ Copyright de la fenêtre des Propriétés sous Windows. Si cette clé est omise et si la clé CommonCopyright l'est également, les informations de Copyright de l'application 4D Server sont utilisées. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ServerCopyright est prise en compte.

# ServerCreator
source: This key is only used under Mac OS. This key is used to define the creator for the Mac OS application built. Its maximum size is 4 characters. If this key is omitted and if the CommonCreator key is also omitted, the creator of 4D Server (4D06) is used. Conversely, if both keys are used, only the value set using the ServerCreator key is taken into account. This key does nothing under Windows.
fr: Cette clé est utilisable sous Mac OS uniquement. Cette clé permet de définir le créateur (creator) pour l'application Serveur Mac OS générée. Sa taille maximale est de 4 caractères. Si cette clé est omise et si la clé CommonCreator n'est pas passée, le créateur de 4D Server (4D06) est utilisé. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ServerCreator est prise en compte. Sous Windows, cette clé n'a pas d'effet.

# ServerComment
source: This key is only used under Windows. This key allows you to update the Comment field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonComment key is also omitted, the comments associated with the 4D Server application are used. Conversely, if both keys are used, only the value set using the ServerComment key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Commentaires de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonComment l'est également, les commentaires associés à l'application 4D Server sont utilisées. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ServerComment est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# ServerCompanyName
source: This key is only used under Windows. This key allows you to update the Company name field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonCompanyName key is also omitted, the company name associated with the 4D Server application is used. Conversely, if both keys are used, only the value set using the ServerCompanyName key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Entreprise de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonCompanyName l'est également, le nom d'entreprise associé à l'application 4D Server est utilisé. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ServerCompanyName est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# ServerFileDescription
source: This key is only used under Windows. This key allows you to update the File description field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonFileDescription key is also omitted, the description associated with the 4D Server application is used. Conversely, if both keys are used, only the value set using the ServerFileDescription key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Description de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonFileDescription l'est également, la description associée à l'application 4D Server est utilisée. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ServerFileDescription est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# ServerInternalName
source: This key is only used under Windows. This key allows you to update the Internal name field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonInternalName key is also omitted, the internal name associated with the 4D Server application is used. Conversely, if both keys are used, only the value set using the ServerInternalName key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Nom interne de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonInternalName l'est également, le nom interne associé à l'application 4D Server est utilisé. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ServerInternalName est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# ServerLegalTrademark
source: This key is only used under Windows. This key allows you to update the Legal trademark field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonLegalTrademark key is also omitted, the legal trademarks associated with the 4D Server application are used. Conversely, if both keys are used, only the value set using the ServerLegalTrademark key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Marques légales de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonLegalTrademark l'est également, les mentions de marques légales associées à l'application 4D Server sont utilisées. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ServerLegalTrademark est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# ServerPrivateBuild
source: This key is only used under Windows. This key allows you to update the Private build field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonPrivateBuild key is also omitted, the private build associated with the 4D Server application is used. Conversely, if both keys are used, only the value set using the ServerPrivateBuild key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Description personnelle de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonPrivateBuild l'est également, la description personnelle associée à l'application 4D Server est utilisée. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ServerPrivateBuild est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# ServerSpecialBuild
source: This key is only used under Windows. This key allows you to update the Special build field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonSpecialBuild key is also omitted, the special build associated with the 4D Server application is used. Conversely, if both keys are used, only the value set using the ServerSpecialBuild key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Description de compilation de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonSpecialBuild l'est également, la description de compilation associée à l'application 4D Server est utilisée. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ServerSpecialBuild est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# Server
source: The keys of this subset are specific to 4D Server application builds.
fr: Les clés de ce sous-ensemble sont spécifiques aux générations d’applications 4D Server.

# ClientVersion
source: This key contains the version number of the application built. If it is omitted and if the CommonVersion key is also omitted, the 4D Client version number is used. Conversely, if both keys are used, only the value set using the ClientVersion key is taken into account. Under Windows, this key causes the File version and Product version fields of the properties window to be updated. Under Mac OS, this key causes the CFBundleShortVersionString and CFBundleVersion fields of the "info.plist" file to be updated.
fr: Cette clé contient le numéro de version de l'application générée. Si elle est omise et si la clé CommonVersion l'est également, le numéro de version de 4D Client est utilisé. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ClientVersion est prise en compte. Sous Windows, cette clé entraîne la mise à jour des champs Version du fichier et Version du produit de la fenêtre des propriétés. Sous Mac OS, cette clé entraîne la mise à jour des champs CFBundleShortVersionString et CFBundleVersion du fichier "info.plist".

# ClientCopyright
source: This key contains the text inserted into: \t• the CFBundleGetInfoString field of the "info.plist" file under Mac OS, \t• the Copyright field of the Properties window under Windows. If this key is omitted and if the CommonCopyright key is also omitted, the Copyright information of the 4D Client application is used. Conversely, if both keys are used, only the value set using the ClientCopyright key is taken into account.
fr: Cette clé contient le texte à insérer dans : \t• le champ CFBundleGetInfoString du fichier "info.plist" sous Mac OS, \t• le champ Copyright de la fenêtre des Propriétés sous Windows. Si cette clé est omise et si la clé CommonCopyright l'est également, les informations de Copyright de l'application 4D Client sont utilisées. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ClientCopyright est prise en compte.

# ClientCreator
source: This key is only used under Mac OS. This key is used to define the creator for the Mac OS Client application built. Its maximum size is 4 characters. If this key is omitted and if the CommonCreator key is not passed, the creator of 4D Client (4D06) is used. Conversely, if both keys are used, only the value set using the ClientCreator key is taken into account. This key does nothing under Windows.
fr: Cette clé est utilisable sous Mac OS uniquement. Cette clé permet de définir le créateur (creator) pour l'application Client Mac OS générée. Sa taille maximale est de 4 caractères. Si cette clé est omise et si la clé CommonCreator n'est pas passée, le créateur de 4D Client (4D06) est utilisé. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ClientCreator est prise en compte. Sous Windows, cette clé n'a pas d'effet.

# ClientComment
source: This key is only used under Windows. This key allows you to update the Comment field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonComment key is also omitted, the comments associated with the 4D Client application are used. Conversely, if both keys are used, only the value set using the ClientComment key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Commentaires de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonComment l'est également, les commentaires associés à l'application 4D Client sont utilisées. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ClientComment est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# ClientCompanyName
source: This key is only used under Windows. This key allows you to update the Company name field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonCompanyName key is also omitted, the company name associated with the 4D Client application is used. Conversely, if both keys are used, only the value set using the ClientCompanyName key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Entreprise de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonCompanyName l'est également, le nom d'entreprise associé à l'application 4D Client est utilisé. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ClientCompanyName est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# ClientFileDescription
source: This key is only used under Windows. This key allows you to update the File description field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonFileDescription key is also omitted, the file description associated with the 4D Client application is used. Conversely, if both keys are used, only the value set using the ClientFileDescription key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Description de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonFileDescription l'est également, la description associée à l'application 4D Client est utilisée. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ClientFileDescription est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# ClientInternalName
source: This key is only used under Windows. This key allows you to update the Internal name field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonInternalName key is also omitted, the internal name associated with the 4D Client application is used. Conversely, if both keys are used, only the value set using the ClientInternalName key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Nom interne de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonInternalName l'est également, le nom interne associé à l'application 4D Client est utilisé. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ClientInternalName est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# ClientLegalTrademark
source: This key is only used under Windows. This key allows you to update the Legal trademark field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonLegalTrademark key is also omitted, the legal trademarks associated with the 4D Client application are used. Conversely, if both keys are used, only the value set using the ClientLegalTrademark key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Marques légales de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonLegalTrademark l'est également, les mentions de marques légales associées à l'application 4D Client sont utilisées. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ClientLegalTrademark est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# ClientPrivateBuild
source: This key is only used under Windows. This key allows you to update the Private build field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonPrivateBuild key is also omitted, the private build associated with the 4D Client application is used. Conversely, if both keys are used, only the value set using the ClientPrivateBuild key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Description personnelle de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonPrivateBuild l'est également, la description personnelle associée à l'application 4D Client est utilisée. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ClientPrivateBuild est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# ClientSpecialBuild
source: This key is only used under Windows. This key allows you to update the Special build field in the Properties window under Windows. Its maximum size is 31 characters. If this key is omitted and if the CommonSpecialBuild key is also omitted, the special build associated with the 4D Client application is used. Conversely, if both keys are used, only the value set using the ClientSpecialBuild key is taken into account. This key does nothing under Mac OS.
fr: Cette clé est utilisable sous Windows uniquement. Cette clé permet de mettre à jour le contenu du champ Description de compilation de la fenêtre des Propriétés sous Windows. Sa taille maximale est de 31 caractères. Si cette clé est omise et si la clé CommonSpecialBuild l'est également, la description de compilation associée à l'application 4D Client est utilisée. A l'inverse, si les deux clés sont utilisées, seule la valeur définie par la clé ClientSpecialBuild est prise en compte. Sous Mac OS, cette clé n'a pas d'effet.

# Client
source: The keys of this subset are specific to 4D Volume Desktop client application builds.
fr: Les clés de ce sous-ensemble sont spécifiques aux générations d’applications clientes avec 4D Volume Desktop.

# BuildApp
source: The 4th Dimension Application Builder provides a number of options that are all available using specific XML keys. Use the BUILD APPLICATION command (in the Tools theme) to set the location of the XML document containing your customized keys. The XML theme commands allow you to process XML documents.
fr: De nombreuses options proposées par le Générateur d'applications de 4e Dimension sont accessibles via des clés XML spécifiques. Utilisez la commande GENERER APPLICATION (thème Outils) pour désigner l'emplacement du document XML contenant vos clés personnalisées. Les commandes du thème XML permettent de traiter les documents XML.

# Licenses
source: These parameters allow you to set access to the license files integrated into the built applications. They must be surrounded with <Licenses> and </Licenses> keys.
fr: Ces paramètres permettent de définir les accès aux fichiers de licences à intégrer dans les applications générées. Ils doivent être encadrés des clés <Licenses> et </Licenses>.

# CS
source: These parameters allow you to set options related to the 4th Dimension client/server version. These parameters must be surrounded with <CS> and </CS> keys.
fr: Ces paramètres permettent de définir des options relatives à la version client/serveur de 4e Dimension. Ils doivent être encadrés des clés <CS> et </CS>.

# SourcesFiles
source: These parameters allow you to set options related to source files. These parameters must be surrounded with <SourcesFiles> and </SourcesFiles> keys. These parameters are broken down into two subsets: - RuntimeVL for 4D Runtime Volume License files, - CS for 4D Server / 4D Client files.
fr: Ces paramètres permettent de définir des options relatives aux fichiers sources. Ils doivent être encadrés des clés <SourcesFiles> et </SourcesFiles>. Ces paramètres se déclinent en deux sous-ensembles : - RuntimeVL pour les fichiers de 4D Runtime Volume License, - CS pour les fichiers de 4D Server / 4D Client.
