Repository: vdelachaux/4DPop-Family
Catalog: 4DPop-Family-20/Components/4DPop AppMaker.4dbase/Resources/*.lproj/BuildAppKey.xlf
Languages: fr

# SignApplication
source: By default, Apple requires that applications downloaded from the internet be signed by the developer. The keys of this subset are specific to signature for application. They are useful only under MacOS
fr: Par défaut, Apple impose que les applications téléchargées depuis internet soient signées par leur développeur. Les clés de ce groupe sont spécifiques à la signature de l'application. Elles ne sont utiles que sous MacOS

# MacSignature
source: This key must be present and set to True in order for the certificate designated by the "MacCertificate" keys to be use to sign the built application.
fr: Cette clé doit être présente et définie à Vrai pour que le certificat désigné par la clé "MacCertificate" soit utilisée pour signer l'application.

# MacCertificate
source: This key indicates to the signing tool which certificate to use as signing identity. Quoting the signing tool manual page: it is either the desired certificate’s subject common name, or the fullname of a keychain identity preference. This key is mandatory if the MacSignature key is set to True. Otherwise, the merged application will not be signed and this key will not be take in account.
fr: Cette clé indique à l'outil de signature le certificat à utiliser pour la signature. Selon la documenation de l'outil de signature: c'est soit le nom du certificat, soit le nom complet d'une identité du trousseau. Cette clé est obligatoire si la clé de MacSignature est définie à Vrai. Sinon, l'application ne sera pas signé et cette clé est ignorée.

# /Preferences4D/BuildApp/BuildApplicationName
source: Name of the compiled file or built application. This name is limited to 27 characters, not counting the extension; up to 31 characters with a 4-character extension. If this key is not used, the compiled file or application will use the name of the structure file.
fr: Nom du fichier compilé ou de l'application généré(e). Ce nom est limité à 27 caractères hors extension - soit 31 caractères, extension de 4 caractères comprise. Si cette clé n'est pas utilisée, le fichier compilé ou l'application portera le nom du fichier de structure.

# /Preferences4D/BuildApp/BuildWinDestFolder
source: File access path of the Mac OS destination. If this key is not used, the location of the structure file will be used. The path can be fixed or relative to the structure file.
fr: Chemin d'accès de destination pour la plate-forme Windows. Si cette clé n'est pas utilisée, l'emplacement du fichier de structure sera utilisé. Le chemin défini peut être absolu ou relatif au fichier de structure.

# /Preferences4D/BuildApp/BuildMacDestFolder
source: File access path of the Mac OS destination. If this key is not used, the location of the structure file will be used. The path can be fixed or relative to the structure file.
fr: Chemin d'accès de destination pour la plate-forme Mac OS. Si cette clé n'est pas passée, l'emplacement du fichier de structure sera utilisé. Le chemin défini peut être absolu ou relatif au fichier de structure.

# DataFilePath
source: Data file pathname of the final application. The pathname set can be absolute or relative to the structure file (.4db). Three syntaxes are accepted: • Multi-platform (Posix): volumes/MacintoshHD/folder/mydata.4DD (absolute) /folder/mydata.4DD (relative) • Windows: C:\mybase\folder\mydata.4DD (absolute) \folder\mydata.4DD (relative) • Mac OS (HFS): Macintosh HD:folder:mydata.4DD (absolute) :folder:mydata.4DD (relative) You should choose the syntax depending on the platform that the final application will be running on. If this key is not used or is invalid, on the initial startup of the final application, 4D will look for the data file next to the structure file and, if it does not find it, will display a standard open file dialog box so that the user can indicate its location.
fr: Chemin d'accès du fichier de données de l'application générée. Le chemin défini peut être absolu ou relatif au fichier de structure (.4db). Trois syntaxes sont acceptées : • Multi-plate-forme (Posix) : volumes/MacintoshHD/dossier/mondata.4DD (absolu) /dossier/mondata.4DD (relatif) • Windows : C:\mabase\dossier\mondata.4DD (absolu) \dossier\mondata.4DD (relatif) • Mac OS (HFS) : Macintosh HD:dossier:mondata.4DD (absolu) :dossier:mondata.4DD (relatif) Vous devez choisir la syntaxe à utiliser en fonction de la plate-forme d'exécution de l'application générée. Si cette clé n'est pas utilisée ou est invalide, au premier lancement de l'application générée, 4D recherche le fichier de données à côté du fichier de structure et, s'il ne le trouve pas, affiche une boîte de dialogue d'ouverture afin que l'utilisateur désigne son emplacement.

# /Preferences4D/BuildApp/BuildCompiled
source: If this key is set to True, a compiled file is built. If this key is not passed or if it is set to False, the compiled file is not built.
fr: Si cette clé contient la valeur True, un fichier compilé est généré. Si cette clé n'est pas passée ou si elle contient False, le fichier compilé n'est pas généré.

# /Preferences4D/BuildApp/BuildApplicationLight
source: If this key is set to True, an application merged with 4D Runtime Volume License using a 4D Runtime Volume License Light serial number is built. If this key is not passed or is set to False, the "Light" merged application is not built. If no file access path is set using the RuntimeVLWinFolder or RuntimeVLMacFolder keys (depending on the operating system used for the build), or if the file access path is invalid, an error is returned and the current project build is stopped.
fr: Si cette clé contient la valeur True, une application fusionnée à 4D Runtime Volume License à l'aide d'un numéro de série 4D Runtime Volume License Light est générée. Si cette clé n'est pas passée ou si elle contient False, l'application fusionnée "Light" n'est pas générée. Si aucun chemin d'accès n'est spécifié à l'aide de la clé RuntimeVLWinFolder ou RuntimeVLMacFolder (suivant la plate-forme de génération) ou si le chemin d'accès spécifié est invalide, une erreur est retournée et la génération pour le projet courant est stoppée.

# /Preferences4D/BuildApp/BuildApplicationSerialized
source: If this key is set to True, an application merged with 4D Runtime Volume License using a 4D Runtime Volume License Pro (complete) serial number is built. If this key is not passed or is set to False, the "Pro" merged application is not built. If no file access path is set using the RuntimeVLWinFolder or RuntimeVLMacFolder keys (depending on the operating system used for the build), or if the file access path is invalid, an error is returned and the current project build is stopped.
fr: Si cette clé contient la valeur True, une application fusionnée à 4D Runtime Volume License à l'aide d'un numéro de série 4D Runtime Volume License Pro (complet) est générée. Si cette clé n'est pas passée ou si elle contient False, l'application fusionnée "Pro" n'est pas générée. Si aucun chemin d'accès n'est spécifié à l'aide de la clé RuntimeVLWinFolder ou RuntimeVLMacFolder (suivant la plate-forme de génération) ou si le chemin d'accès spécifié est invalide, une erreur est retournée et la génération pour le projet courant est stoppée.

# /Preferences4D/BuildApp/ArrayExcludedPluginName
source: By default, all plug-ins present in the Plugins folder are integrated into the built application. It is nevertheless possible to set a list of plug-ins to be excluded when building the application using this key. This key is used to set the list of plug-ins to be excluded based on their names (plug-in names are unique). You can also set a list of plug-ins to be excluded based on their numbers using the ArrayExcludedPluginID key.
fr: Par défaut, tous les plug-ins présents dans le dossier Plugins sont intégrés à l'application générée. Il est toutefois possible de définir à l'aide de cette clé une liste de plug-ins à exclure au moment de la construction de l'application. Cette clé permet de définir la liste des plug-ins sur la base de leur nom (les noms des plug-ins sont uniques). Vous pouvez également définir une liste de plug-ins sur la base de leur numéro à l'aide de la clé ArrayExcludedPluginID.

# /Preferences4D/BuildApp/ArrayExcludedPluginID
source: By default, all plug-ins present in the Plugins folder are integrated into the built application. It is nevertheless possible to set a list of plug-ins to be excluded when building the application using this key. This key is used to set the list of plug-ins to be excluded based on their ID (number). Plug-in IDs are shown on the "Plug-ins" page of the Application builder. You can also find the plug-in ID in its 4BNX resource. You can also set a list of plug-ins to be excluded based on their names using the ArrayExcludedPluginName key.
fr: Par défaut, tous les plug-ins présents dans le dossier Plugins sont intégrés à l'application générée. Il est toutefois possible de définir à l'aide de cette clé une liste de plug-ins à exclure au moment de la construction de l'application. Cette clé permet de définir la liste des plug-ins sur la base de leur ID (leur numéro). Les IDs des plug-ins sont visibles dans la page "Plug-ins" du Générateur d'applications. Vous pouvez également lire l'ID d'un plug-in dans sa ressource 4BNX. Vous pouvez également définir une liste de plug-ins à exclure sur la base de leur nom à l'aide de la clé ArrayExcludedPluginName.

# /Preferences4D/BuildApp/IncludeAssociatedFolders
source: This option allows to copy the "Plugins", "Resources", "Components" and "Extras" folders beside the compiled structure.
fr: Cette option permet de copier les dossiers "Plugins", "Resources", "Components" et "Extras" à côté de la structure compilée.

# /Preferences4D/BuildApp/BuildComponent
source: The compiled structure will be built in the "Components" folder. It will be included in a "package" suffixed ".4dbase". The "Resources" and "Extras" folders will also be copied into this package.
fr: La structure compilée sera générée dans un dossier "Components". Elle sera incluse dans un "package" suffixé ".4dbase". Les dossiers "Resources" et "Extras" seront également copiés dans ce package.

# /Preferences4D/BuildApp/ArrayExcludedComponentName
source: By default, all components present in the Components folder of the original structure are integrated into the built application. It is nevertheless possible to set a list of component names to be excluded when building the application using this key.
fr: Par défaut, tous les composants présents dans le dossier Components de la structure d’origine sont intégrés à l’application générée. Il est toutefois possible de définir à l’aide de cette clé une liste de noms de composants à exclure au moment de la construction de l’application.

# ArrayLicenseWin
source: This key is used to specify the acces path of the license file(s) to be integrated into the Windows version of the application. These files can be located anywhere on your PC. If this key is not used, no license number will be integrated and the application will start in demo mode.
fr: Cette clé permet de désigner le chemin d'accès du ou des fichier(s) de licence à intégrer à la version Windows de l'application. Ces fichiers peuvent se trouver à n'importe quel emplacement sur votre PC. Si cette clé n'est pas utilisée, aucun numéro de licence ne sera intégré et l'application démarrera en mode évaluation.

# ArrayLicenseMac
source: This key is used to specify the acces path of the license file(s) to be integrated into the Mac OS version of the application. These files can be located anywhere on your Macintosh. If this key is not used, no license number will be integrated and the application will start in demo mode.
fr: Cette clé permet de désigner le chemin d'accès du ou des fichier(s) de licence à intégrer à la version Mac OS de l'application. Ces fichiers peuvent se trouver à n'importe quel emplacement sur votre Macintosh. Si cette clé n'est pas utilisée, aucun numéro de licence ne sera intégré et l'application démarrera en mode évaluation.

# /Preferences4D/BuildApp/CS/BuildServerApplication
source: If this key is set to True, a Client/Server application is built. If the key is not passed or if it is set to False, the Client/Server application is not built.
fr: Si cette clé contient la valeur True, une application Client/Serveur est générée. Si cette clé n'est pas passée ou si elle contient False, l'application Client/Serveur n'est pas générée.

# /Preferences4D/BuildApp/CS/BuildCSUpgradeable
source: If this key is set to True, a Client update application, ready to download, is built for Mac OS and Windows. If the key is not passed or if it is set to False, the Client update application is not built.
fr: Si cette clé contient la valeur True, une application Cliente de mise à jour, prête à télécharger, est générée pour les plates-formes Mac OS et Windows. Si cette clé n'est pas passée ou si elle contient False, l'application Cliente de mise à jour n'est pas générée.

# IPAddress
source: This key contains the IP address of the application server (where applicable). This key is not mandatory since 4th Dimension features internal mechanisms for managing the network. However, an IP address is required in certain cases (WAN, specific port numbers, etc.). When it is specified, the IP address is stored in a file named "EnginedServer.xml," which is placed in the 4D Extensions folder of the client application.
fr: Cette clé contient l'adresse IP de l'application serveur (le cas échéant). Cette clé n'est pas obligatoire car 4e Dimension dispose de mécanismes internes pour la prise en charge du réseau. Toutefois, dans certains cas (WAN, numéros de port spécifique, etc.), une adresse IP est requise. Lorsqu'elle est spécifiée, l'adresse IP est stockée dans un fichier nommé "EnginedServer.xml", placé dans le dossier 4D Extensions de l'application cliente.

# PortNumber
source: This key contains the TCP port number of the desired server. By default, the port number is set to 19813 and it is generally not required to specify it. This key is required when the server's port number has been modified. When it is specified, the IP address is stored in a file named "EnginedServer.xml," which is placed in the 4D Extensions folder of the client application.
fr: Cette clé contient le numéro de port TCP du serveur visé. Par défaut, ce numéro de port est le 19813 et il n'est généralement pas obligatoire de le préciser. Cette clé est requise lorsque le numéro de port du serveur a été modifié. Lorsqu'il est spécifié, le numéro de port TCP est stocké dans un fichier nommé "EnginedServer.xml", placé dans le dossier 4D Extensions de l'application cliente.

# /Preferences4D/BuildApp/CS/HardLink
source: This key allows you to modify the signature for client and server applications. The maximum length is 31 characters.
fr: Cette clé permet de modifier la signature qui associe les applications clientes et le serveur. Sa taille maximum est de 31 caractères.

# RangeVersMin
source: This key allows you to specify the minimum Client version; earlier versions will not be authorized to connect to the Server (for example, 2). This key is used in conjunction with RangeVersMax. The version number must be specified using the CurrentVers key.
fr: Cette clé permet de spécifier le numéro de version minimal du Client, au-dessous duquel il ne sera pas autorisé à se connecter au Serveur (par exemple 2). Cette clé s'utilise conjointement à RangeVersMax. Le numéro de version doit être spécifié à l'aide de la clé CurrentVers.

# RangeVersMax
source: This key allows you to specify the maximum Client version; later versions will not be authorized to connect to the Server (for example, 3). This key is used in conjunction with RangeVersMin. The version number must be specified using the CurrentVers key.
fr: Cette clé permet de spécifier le numéro de version maximal du Client, au-dessus duquel il ne sera pas autorisé à se connecter au Serveur (par exemple 3). Cette clé s'utilise conjointement à RangeVersMin. Le numéro de version doit être spécifié à l'aide de la clé CurrentVers.

# /Preferences4D/BuildApp/CS/CurrentVers
source: This key allows you to specify the current version number of the built application. If the RangeVersMax and RangeVersMin keys are not used, this number is purely for informational purposes. If these keys are used, the Server application will read this number to determine whether the Client belongs to the defined interval and is thus authorized to connect.
fr: Cette clé permet de spécifier le numéro de version courant de l'application générée. Si les clés RangeVersMax et RangeVersMin ne sont pas utilisées, ce numéro est uniquement informatif. Si ces clés sont utilisées, l'application Serveur lira ce numéro afin de déterminer si le Client appartient à l'intervalle défini et est donc autorisé à se connecter.

# RuntimeVLIncludeIt
source: This key must be present and set to True in order for the 4D Runtime Volume License application designated by the RuntimeVLWinFolder and/or RuntimeVLMacFolder keys to be integrated into the built application.
fr: Cette clé doit être présente et contenir la valeur True pour que l'application 4D Runtime Volume License désignée par les clés RuntimeVLWinFolder et/ou RuntimeVLMacFolder soit intégrée à l'application générée.

# RuntimeVLWinFolder
source: This key provides the access path of the folder containing the 4D Runtime Volume License application for Windows. This key is mandatory if the BuildApplicationSerialized and/or BuildApplicationLight keys are set to True. Otherwise, an error is returned and the current project build is stopped.
fr: Cette clé fournit le chemin d'accès du dossier contenant l'application 4D Runtime Volume License pour la plate-forme Windows. Cette clé est obligatoire si les clés BuildApplicationSerialized et/ou BuildApplicationLight sont mises à True. Sinon, une erreur est retournée et la génération pour le projet courant est stoppée.

# RuntimeVLMacFolder
source: This key provides the access path of the package containing the 4D Runtime Volume License application for Mac OS. This key is mandatory if the BuildApplicationSerialized and/or BuildApplicationLight keys are set to True. Otherwise, an error is returned and the current project build is stopped.
fr: Cette clé fournit le chemin d'accès du paquet (package) contenant l'application 4D Runtime Volume License pour la plate-forme Mac OS. Cette clé est obligatoire si les clés BuildApplicationSerialized et/ou BuildApplicationLight sont mises à True. Sinon, une erreur est retournée et la génération pour le projet courant est stoppée.

# RuntimeVLIconWinPath
source: This key provides the access path of the application icon to build for Windows. This icon will have an ".ico" extension. If this key is omitted, the default 4D Runtime Volume License icon will be used.
fr: Cette clé fournit le chemin d'accès de l'icône de l'application à générer pour la plate-forme Windows. L'icône sera du type ".ico". Si cette clé est omise, l'icône par défaut de 4D Runtime Volume License sera utilisée.

# RuntimeVLIconMacPath
source: This key provides the access path of the application icon to build for Mac OS. This icon will have an "icns" extension. Consequently, the "info.plist" file will be updated. If this key is omitted, the default 4D Runtime Volume License icon will be used.
fr: Cette clé fournit le chemin d'accès de l'icône de l'application à générer pour la plate-forme Mac OS. L'icône sera du type "icns". Le fichier "info.plist" sera mis à jour en conséquence. Si cette clé est omise, l'icône par défaut de 4D Runtime Volume License sera utilisée.

# RuntimeVL
source: These parameters allow you to set options related to 4D Volume Desktop source files.
fr: Ces paramètres permettent de définir des options relatives aux fichiers sources de l’application 4D Volume Desktop.

# ServerIncludeIt
source: This key must be present and set to True in order for the 4D Server application designated by the ServerWinFolder and/or ServerMacFolder keys to be integrated into the built application.
fr: Cette clé doit être présente et contenir la valeur True pour que l'application 4D Server désignée par les clés ServerWinFolder et/ou ServerMacFolder soit intégrée à l'application générée.

# ServerWinFolder
source: This key provides the access path of the folder containing the 4D Server application for Windows. This key is mandatory if the BuildServerApplication is set to True. Otherwise, an error is returned and the current project build is stopped.
fr: Cette clé fournit le chemin d'accès du dossier contenant l'application 4D Server pour la plate-forme Windows. Cette clé est obligatoire si la clé BuildServerApplication est mise à True. Sinon, une erreur est retournée et la génération pour le projet courant est stoppée.

# ServerMacFolder
source: This key provides the access path of the folder containing the 4D Server application for Mac OS. This key is mandatory if the BuildServerApplication is set to True. Otherwise, an error is returned and the current project build is stopped.
fr: Cette clé fournit le chemin d'accès du paquet (package) contenant l'application 4D Server pour la plate-forme Mac OS. Cette clé est obligatoire si la clé BuildServerApplication est mise à True. Sinon, une erreur est retournée et la génération pour le projet courant est stoppée.

# ClientWinIncludeIt
source: This key must be present and set to True in order for the 4D Client application designated by the ClientWinFolderToWin and/or ClientMacFolderToWin keys to be integrated into the Windows application that is built.
fr: Cette clé doit être présente et contenir la valeur True pour que le 4D Client désigné par les clés ClientWinFolderToWin et/ou ClientWinFolderToMac soit intégrée à l'application Windows générée.

# ClientWinFolderToWin
source: This key provides the access path of the 4D Client Windows application for the Windows platform. This key is mandatory if the BuildServerApplication key is set to True under Windows.
fr: Cette clé fournit le chemin d'accès du dossier contenant l'application 4D Client Windows destiné à la plate-forme Windows. Cette clé est obligatoire si la clé BuildServerApplication est mise à True sur la plate-forme Windows.

# ClientWinFolderToMac
source: This key provides the access path of the folder containing the 4D Client Windows application for the Mac OS platform. This key is mandatory if the BuildServerApplication key is set to True under Mac OS.
fr: Cette clé fournit le chemin d'accès du dossier contenant l'application 4D Client Windows destiné à la plate-forme Mac OS. Cette clé est obligatoire si la clé BuildServerApplication est mise à True sur la plate-forme Mac OS.

# ClientMacIncludeIt
source: This key must be present and set to True in order for the 4D Client application designated by the ClientWinFolderToMac and/or ClientMacFolderToMac keys to be integrated into the Mac OS application that is built.
fr: Cette clé doit être présente et contenir la valeur True pour que le 4D Client désignée par les clés ClientMacFolderToWin et/ou ClientMacFolderToMac soit intégrée à l'application Mac OS générée.

# ClientMacFolderToWin
source: This key provides the access path of the 4D Client Mac OS application package for the Windows platform. This key is mandatory if the BuildServerApplication key is set to True under Windows.
fr: Cette clé fournit le chemin d'accès du paquet (package) de l'application 4D Client Mac OS destiné à la plate-forme Windows. Cette clé est obligatoire si la clé BuildServerApplication est mise à True sur la plate-forme Windows.
