Repository: vdelachaux/4DPop-Family
Catalog: 4DPop ColorChart.4dbase/Resources/*.lproj/ColorChart.xlf
Languages: fr

# ColorChart_Hue
source: Hue:
fr: Teinte :

# ColorChart_Luminosity
source: Luminosity:
fr: Luminosité :

# ColorChart_HSL
source: HSL
fr: TSL

# ColorChart_RGB
source: RGB
fr: RVB

# ColorChart_ColorChart
source: Colors
fr: Couleurs

# ColorChart_WebColorsOnly
source: Web colors only
fr: Couleurs web uniquement

# ColorChart_Fgd
source: Fgd
fr: Avt

# ColorChart_Bgd
source: Bgd
fr: Arr.

# ColorChart_InOrderTo
source: In order to create a sample, drag and drop from the large color area. The samples will be memorized as well as their names. They can then be dragged to the 4D method editor in order to generate the code corresponding to the foreground and background colors. E.g.: SET RGB COLORS (*;"Sample1";2356+;456456)
fr: Pour créer un échantillon, utilisez le glisser-déposer à partir de la grande zone de couleur. Les échantillons seront mémorisés ainsi que leurs noms. Ils peuvent ensuite être glissés vers l'éditeur de méthodes 4D afin de générer le code correspondant à la teinte d'avant-plan et d'arrière-plan. Ex : FIXER COULEURS RVB(*;"Échantillon01";123132;456456)

# ColorChart_Mode1
source: 256 hues
fr: 256 teintes

# ColorChart_Mode3
source: 256 luminosities
fr: 256 luminosités

# ColorChart_Mode4
source: 16 hues x 16 luminosities
fr: 16 teintes x 16 luminosités

# ColorChart_Mode5
source: 16 hues x 16 saturations
fr: 16 teintes x 16 saturations

# ColorChart_Mode6
source: 16 luminosities x 16 saturations
fr: 16 luminosités x 16 saturations

# ColorChart_Sample
source: Sample
fr: Échantillon
