Repository: vdelachaux/4DPop-Family
Catalog: 4DPop-Family-19R8/Components/4DPop Image Buddy.4dbase/Resources/*.lproj/Editor.xlf
Languages: fr

# ElementsNumber
source: <◊Lon_File_Number> elements
fr: <◊Lon_File_Number> éléments

# BrowserNoImageFound
source: No image found.
fr: Aucune image trouvée.

source: Name:
fr: Nom :

source: Are you sure?
fr: Êtes vous certain ?

# WindowTitle
source: Pictures Browser
fr: Navigateur d'images

# BrowserCopy
source: (Copy
fr: (Copie

source: Folder name:
fr: Nom du dossier :

source: New Folder
fr: Nouveau dossier

# NewImage
source: Picture.4pct
fr: Image.4pct

# NewName
source: New name for "{name}":
fr: Nouveau nom pour "{name}" :

# DeleteFolder
source: Are you sure you want to delete folder "{name}"?
fr: Êtes vous certain de vouloir supprimer le dossier "{name}" ?

# DeleteFile
source: Are you sure you want to delete "{name}" file?
fr: Êtes vous certain de vouloir supprimer le fichier "{name}" ?

# DeleteFiles
source: Are you sure you want to delete the {number} selected files?
fr: Êtes vous certain de vouloir supprimer les {number} fichiers sélectionnés ?

source: Import "PICT" resources from file…
fr: Importer les ressources "PICT" du fichier…

source: Import "cicn" resources from file…
fr: Importer les ressources "cicn" du fichier…

source: Import from picture library
fr: Importer les images de la bibliothèque

# YouWantToImport
source: You want to import {ImageNumber} pictures in the folder "{destFolder}".
fr: Vous voulez importer {ImageNumber} images dans le dossier "{destFolder}".

# AFileWithThisNameAlreadyExist
source: A file with this name already exist at this place. Would you replace it?
fr: Un fichier à ce nom existe déjà à cet emplacement. Voulez vous le remplacer ?

source: Flip Horizontally
fr: Miroir horizontal

source: Flip vertically
fr: Miroir vertical

# FadeToGreyScale
source: Grey scale
fr: Niveaux de gris

source: Transparency
fr: Transparence

source: Preview:
fr: Prévisualistion :

# Convert
source: Transform
fr: Transformer

source: Scale
fr: Redimensionnement
