Repository: vdelachaux/4DPop-Family
Catalog: 4DPop Rulers.4dbase/Resources/*.lproj/4DPopRulers.xlf
Languages: fr, ja

# Unit_1
source: Pixels
fr: Points
ja: ピクセル

# Unit_2
source: Inches
fr: Pouces
ja: インチ

# Unit_4
source: Centimeters
fr: Centimètres
ja: センチメートル

source: You have really a so large screen?
fr: Vous avez- vraiment un écran si grand ?
ja: 本当に大きなスクリーンを持っていますか?

source: Delete Guidelines
fr: Supprimer les lignes de repérage
ja: ガイドラインを削除

source: Screen Simulation
fr: Simuler un écran
ja: スクリーンのシミュレーション

# Switch
source: Switch between the vertical and horizontal ruler
fr: Bascule entre la règle verticale et horizontale
ja: ルーラを縦と横でスイッチ

# ChangeUnit
source: Change the unit.
fr: Changer d'unité.
ja: 単位変更

# ModifyTheSizeOfTheWindow
source: Modify the size of the window. Option/Alt + click, to dimension the rule with the size of the screen.
fr: Modifiez la taille de la fenêtre. Option/Alt + clic, pour dimensionner la règle à la taille de l'écran.
ja: ウィンドウのサイズを変更 Option/Alt + クリックして、スクリーンサイズにルーラを合わせる。

# ClickToMoveTheRule
source: Click to move the rule. Option/Alt + click to create a guide.
fr: Cliquez pour déplacer la règle. Option/Alt + clic pour créer un guide.
ja: クリックしてルーラを移動 Option/Alt + クリックしてガイドを作成。

# DeleteGuide
source: Option/Alt + click to delete this guideline
fr: Option/Alt + clic pour supprimer cette ligne de repérage
ja: Option/Alt + クリックしてガイドラインを削除

# CloseButton
source: Close
fr: Fermer
ja: 閉じる

# InteractiveTickMark
source: Use the interactive tick mark for more accurate measurements
fr: Donne précisement la position de la souris
ja: より正確な計測を行うには、チックマークを使用します。

source: Click here to display a menu
fr: Cliquez ici pour dérouler un menu
ja: ここをクリックしてメニューを表示

source: Ruler
fr: Règle
ja: ルーラ

# ToolHelpTip
source: Display a ruler on screen
fr: Affiche une règle à l'écran
ja: スクリーンにルーラを表示
