Repository: vdelachaux/4DPop-Family
Catalog: 4DPop Pasteboard.4dbase/Resources/*.lproj/main.xlf
Languages: fr

# 4DPopTool
source: Pasteboards
fr: Conteneurs

# 4DPopTool_1
source: Copy & Paste Pasteboard‚Ä¶
fr: Conteneur de copier-coller…

# 4DPopTool_2
source: Drag & Drop Pasteboard‚Ä¶
fr: Conteneur de glisser-déposer…

# 4DPopTool_3
source: Clipboard History
fr: Historique du presse-papiers

# viewer_windowTitle
source: Clipboard
fr: Presse-papiers

# autoUpdate
source: Automatically update
fr: Mise à jour automatique

# readClipboard
source: Load Clipboard
fr: Charger le Presse-papiers

# tips_dataType
source: Data Types: Select one to see the content
fr: Types de données : Sélectionnez pour voir le contenu

# tips_autoUpdate
source: If this option is checked, the contents of the clipboard will be loaded automatically each time the window is activated.
fr: Si cette option est cochée, le contenu du presse-papiers sera chargé automatiquement à chaque fois que cette fenêtre passe au premier plan.

# tips_load
source: Click here to manually load the current contents of the clipboard.
fr: Cliquez ici pour charger manuellement le contenu actuel du presse-papiers.

source: Drop Something Here
fr: Déposez quelque chose ici

# dd_windowTitle
source: Drag & Drop Pasteboard
fr: Conteneur de glisser-déposer
