Repository: vdelachaux/4DPop-Family
Catalog: 4DPop-Family-20/Components/4DPop QuickOpen.4dbase/Resources/*.lproj/quickOpen.xlf
Languages: fr

source: Edit…
fr: Éditer…

source: Edit Form Method…
fr: Éditer la méthode du formulaire...

source: Edit documentation…
fr: Editer la documentation...

source: Show source file…
fr: Montrer le fichier source...

source: Show documentation file…
fr: Montrer le fichier de documentation...

source: Copy the name
fr: Copier le nom

source: Delete source file…
fr: Supprimer le fichier source...

source: Delete documentation…
fr: Supprimer la documentation...

source: Delete Form Method…
fr: Supprimer la méthode formulaire...

source: Create documentation…
fr: Créer la documentation...

source: Execute
fr: Exécuter

source: Are you sure you want to delete the "{type}" "{item}"?
fr: Êtes-vous sûr de vouloir supprimer le "{type}" "{item}" ?

source: Delete
fr: Supprimer

# keepIt
source: Keep
fr: Gardez

# areYouSureYouWantToDeleteTheDocumentationForTypeItem
source: Are you sure you want to delete the documentation for the {type} "{item}"?
fr: Êtes-vous sûr de vouloir supprimer la documentation de {type} "{item}" ?

source: Runtime Explorer
fr: Explorateur d'exécution

source: Structure Settings
fr: Propriétés structure

source: User Settings
fr: Propriétés utilisateur

source: Check Syntax
fr: Vérifier la syntaxe

# securityCenter
source: Maintenance & Security Center
fr: Centre de maintenance et de sécurité

source: Restart
fr: Redémarrer

source: Reload Project
fr: Recharger le projet

source: Quit
fr: Quitter

# build
source: Build Application
fr: Générer l'application

source: Open Administration Window
fr: Ouvrir la fenêtre d'administration

source: Start Web Server
fr: Démarrer le serveur Web

source: Stop Web Server
fr: Arrêter le serveur Web

source: Active 4D Folder
fr: Dossier 4D courant

source: Resources Folder
fr: Dossier ressources

source: Editor Theme Folder
fr: Dossier des thèmes de l'éditeur

source: Web Folder
fr: Dossier racine web

source: Database Folder
fr: Dossier base de données

source: Data Folder
fr: Dossier données

source: Logs Folder
fr: Dossier fichiers d'historique

source: Settings Folder
fr: Dossier des paramètres

source: Documentation Folder
fr: Dossier de la documentation

source: MobileApps Folder
fr: Dossier mobileApps

source: Project Folder
fr: Dossier projet

# result
source: Results
fr: résultats

source: Compile
fr: Compiler

# formNotFound
source: Form not found: “{name}"
fr: Formulaire non trouvé : “{name}"

source: The user settings of the database have not been activated.
fr: Les paramètres utilisateur de la base de données n'ont pas été activés.

source: Where
fr: Où

source: Line
fr: Ligne

source: Error
fr: Erreur

source: is successful
fr: a réussi

source: Syntax check
fr: Vérification de la syntaxe
